//FEATURES AVAILABLE : 

//naligai to vinaligai  = 5.12 -> 312         || nalToVinal(x)
//vinaligai to naligai  = 312 -> 5.12         || VinalToNal(x)
//Naligai Subtraction = 26.01-5.12 -> 20.49      || nalSub(x,y)
//Naligai Addition = 26.01+5.12 -> 31.13   || nalAdd(x,y)

let raasivalue = [4.33, 5.07, 5.28, 5.20, 5.03, 4.59, 5.12, 5.27, 5.20, 4.48, 4.19, 4.14];
let raasiname = ["மேஷம்", "ரிஷபம்", "மிதுனம்", "கடகம்", "சிம்மம்", "கன்னி", "துலாம்", "விருச்சிகம்", "தனுசு", "மகரம்", "கும்பம்", "மீனம்"];
let Natchathiram = ["அஸ்வினி","பரணி","கார்த்திகை","ரோகிணி","மிருகசீரிடம்","திருவாதிரை","புனர்பூசம்","பூசம்","ஆயில்யம்","மகம்","பூரம்","உத்திரம்","ஹஸ்தம்","சித்திரை","சுவாதி","விசாகம்","அனுசம்","கேட்டை","மூலம்","பூராடம்","உத்திராடம்","திருவோணம்","அவிட்டம்","சதயம்","பூரட்டாதி","உத்திரட்டாதி","ரேவதி"]


const raasiNatchathiram = {
    மேஷம்: [
      "அஸ்வினி 1", "அஸ்வினி 2", "அஸ்வினி 3", "அஸ்வினி 4",
      "பரணி 1", "பரணி 2", "பரணி 3", "பரணி 4",
      "கார்த்திகை 1"
    ],
    ரிஷபம்: [
      "கார்த்திகை2", "கார்த்திகை3", "கார்த்திகை4",
      "ரோஹினி1", "ரோஹினி2", "ரோஹினி3", "ரோஹினி4",
      "மிருகசீரிடம்1", "மிருகசீரிடம்2"
    ],
    மிதுனம்: [
      "மிருகசீரிடம்3", "மிருகசீரிடம்4",
      "திருவாதிரை1", "திருவாதிரை2", "திருவாதிரை3", "திருவாதிரை4",
      "புனர்பூசம்1", "புனர்பூசம்2", "புனர்பூசம்3"
    ],
    கடகம்: [
      "புனர்பூசம்4",
      "பூசம்1", "பூசம்2", "பூசம்3", "பூசம்4",
      "ஆயில்யம்1", "ஆயில்யம்2", "ஆயில்யம்3", "ஆயில்யம்4"
    ],
    சிம்மம்: [
      "மகம்1", "மகம்2", "மகம்3", "மகம்4",
      "பூரம்1", "பூரம்2", "பூரம்3", "பூரம்4",
      "உத்திரம்1"
    ],
    கன்னி: [
      "உத்திரம்2", "உத்திரம்3", "உத்திரம்4",
      "அஸ்தம்1", "அஸ்தம்2", "அஸ்தம்3", "அஸ்தம்4",
      "சித்திரை1", "சித்திரை2"
    ],
    துலாம்: [
      "சித்திரை3", "சித்திரை4",
      "ஸ்வாதி1", "ஸ்வாதி2", "ஸ்வாதி3", "ஸ்வாதி4",
      "விசாகம்1", "விசாகம்2", "விசாகம்3"
    ],
    விருச்சிகம்: [
      "விசாகம்4",
      "அனுஷம்1", "அனுஷம்2", "அனுஷம்3", "அனுஷம்4",
      "கேட்டை1", "கேட்டை2", "கேட்டை3", "கேட்டை4"
    ],
    தனுசு: [
      "மூலம்1", "மூலம்2", "மூலம்3", "மூலம்4",
      "பூராடம்1", "பூராடம்2", "பூராடம்3", "பூராடம்4",
      "உத்திராடம்1"
    ],
    மகரம்: [
      "உத்திராடம்2", "உத்திராடம்3", "உத்திராடம்4",
      "திருவோணம்1", "திருவோணம்2", "திருவோணம்3", "திருவோணம்4",
      "அவிட்டம்1", "அவிட்டம்2"
    ],
    கும்பம்: [
      "அவிட்டம்3", "அவிட்டம்4",
      "சதயம்1", "சதயம்2", "சதயம்3", "சதயம்4",
      "பூரட்டாதி1", "பூரட்டாதி2", "பூரட்டாதி3"
    ],
    மீனம்: [
      "பூரட்டாதி4",
      "உத்திரட்டாதி1", "உத்திரட்டாதி2", "உத்திரட்டாதி3", "உத்திரட்டாதி4",
      "ரேவதி1", "ரேவதி2", "ரேவதி3", "ரேவதி4"
    ]
  };


function nalToVinal(x)
{
    return (Math.floor(x)*60)+((x*100)%100)
}

function VinalToNal(x)
{
    let result = parseInt(x/60)
    result = result + (x-(result*60))/100;
    return result;
}

function nalSub(x,y)
{
    x = nalToVinal(x);
    y = nalToVinal(y);
    let z = VinalToNal(x-y)
    if (z<1)
        return (z.toFixed(2));
    return z;
}

function nalAdd(x,y)
{
    x = nalToVinal(x);
    y = nalToVinal(y);
    let z = VinalToNal(x+y)
    return z;
}






